using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace SavageOrcs.DbContext.Migrations
{
    public partial class InsertKeyWordsValues : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            string Now = DateTime.Now.ToString("yyyy-MM-dd HH:mm:ss.fff");

            string[] Ids = new string[] {
                "11111111-2222-3333-4444-555555555555",
                "11111111-2222-3333-4444-555555555556",
                "11111111-2222-3333-4444-555555555557",
                "11111111-2222-3333-4444-555555555558",
                "11111111-2222-3333-4444-555555555559",
                "11111111-2222-3333-4444-555555555550",
                "11111111-2222-3333-4444-555555555565",
                "11111111-2222-3333-4444-555555555575",
                "11111111-2222-3333-4444-555555555585",
                "11111111-2222-3333-4444-555555555595",
                "11111111-2222-3333-4444-555555555505",
                "11111111-2222-3333-4444-555555555655",
                "11111111-2222-3333-4444-555555555755",
                "11111111-2222-3333-4444-555555555855",
                "11111111-2222-3333-4444-555555555955",
                "11111111-2222-3333-4444-555555555055",
                "11111111-2222-3333-4444-555555556555",
                "11111111-2222-3333-4444-555555557555",
                "11111111-2222-3333-4444-555555558555",
                "11111111-2222-3333-4444-555555559555",
                "11111111-2222-3333-4444-555555550555",
                "11111111-2222-3333-4444-555555565555",
                "11111111-2222-3333-4444-555555575555",
                "11111111-2222-3333-4444-555555585555",
                "11111111-2222-3333-4444-555555595555",
            };

            string[] KeyWords = new string[] {
                "Z",
                "V",
                "Мина",
                "Мины",
                "Дети",
                "Приказ",
                "Діти",
                "Наказ",
                "Україна",
                "Украина",
                "НАТО",
                "Суки",
                "Сука",
                "Азов",
                "Россия",
                "Росія",
                "SOS",
                "Мир",
                "Простите",
                "Чечня",
                "Зеленский",
                "Russia",
                "Люди",
                "Rus",
                "Нацики"
            };
            var toInsert = "INSERT INTO [dbo].[KeyWords] ([Id], [Name], [UpdatedDate], [CreatedDate]) VALUES ";
            for(int i = 0; i < KeyWords.Length; i++)
            {
                toInsert += "('" + Ids[i] + "', '" + KeyWords[i] + "', '" + Now + "', '" + Now + "'), ";
            }

            toInsert = toInsert[..^2];

            File.WriteAllText(@"D:\Навчання\da.txt", toInsert);
            migrationBuilder.Sql(toInsert);
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {

        }
    }
}
